test/fixtures/test_prices_with_multiple_periods.xml

<Product>
  <RecordReference>xxx</RecordReference>
  <NotificationType>03</NotificationType>
  <ProductIdentifier>
    <ProductIDType>03</ProductIDType>
    <IDValue>978123456789</IDValue>
  </ProductIdentifier>
  <DescriptiveDetail>
    <ProductComposition>00</ProductComposition>
    <ProductForm>EA</ProductForm>
    <ProductFormDetail>E107</ProductFormDetail>
    <EpubTechnicalProtection>03</EpubTechnicalProtection>
    <TitleDetail>
      <TitleType>01</TitleType>
      <TitleElement>
        <TitleElementLevel>01</TitleElementLevel>
        <TitleText>XXX</TitleText>
      </TitleElement>
    </TitleDetail>
    <Contributor>
      <SequenceNumber>1</SequenceNumber>
      <ContributorRole>A01</ContributorRole>
      <PersonName>XXX XXX</PersonName>
    </Contributor>
    <NoEdition/>
    <Language>
      <LanguageRole>01</LanguageRole>
      <LanguageCode>fre</LanguageCode>
    </Language>
  </DescriptiveDetail>
  <CollateralDetail>
    <TextContent>
      <TextType>03</TextType>
      <ContentAudience>00</ContentAudience>
      <Text>XXX
      </Text>
    </TextContent>
  </CollateralDetail>
  <PublishingDetail>
    <Publisher>
      <PublishingRole>01</PublishingRole>
      <PublisherIdentifier>
        <PublisherIDType>06</PublisherIDType>
        <IDValue>xxx</IDValue>
      </PublisherIdentifier>
      <PublisherName>XXX</PublisherName>
    </Publisher>
    <PublishingStatus>04</PublishingStatus>
    <PublishingDate>
      <PublishingDateRole>01</PublishingDateRole>
      <DateFormat>14</DateFormat>
      <Date>20110601T000000+0200</Date>
    </PublishingDate>
    <SalesRights>
      <SalesRightsType>01</SalesRightsType>
      <Territory>
        <CountriesIncluded>AT BE BG CY CZ DE ES EE FI FR GR HU IE IT LT LU LV MT NL PL PT RO SK SI</CountriesIncluded>
      </Territory>
    </SalesRights>
  </PublishingDetail>
  <ProductSupply>
    <MarketPublishingDetail>
      <MarketPublishingStatus>04</MarketPublishingStatus>
    </MarketPublishingDetail>
    <SupplyDetail>
      <Supplier>
        <SupplierRole>06</SupplierRole>
        <SupplierIdentifier>
          <SupplierIDType>06</SupplierIDType>
          <IDValue>xxx</IDValue>
        </SupplierIdentifier>
        <SupplierName>XXX</SupplierName>
      </Supplier>
      <ProductAvailability>20</ProductAvailability>
      <SupplyDate>
        <SupplyDateRole>08</SupplyDateRole>
        <DateFormat>14</DateFormat>
        <Date>20110601T120000+0200</Date>
      </SupplyDate>
      <Price>
        <PriceType>42</PriceType>
        <PriceQualifier>00</PriceQualifier>
        <PriceAmount>8.99</PriceAmount>
        <CurrencyCode>EUR</CurrencyCode>
        <Territory>
          <CountriesIncluded>FR</CountriesIncluded>
        </Territory>
      </Price>
      <Price>
        <PriceType>42</PriceType>
        <PriceQualifier>08</PriceQualifier>
        <PriceAmount>4.99</PriceAmount>
        <CurrencyCode>EUR</CurrencyCode>
        <Territory>
          <CountriesIncluded>FR</CountriesIncluded>
        </Territory>
        <PriceDate>
          <PriceDateRole>14</PriceDateRole>
          <Date>20160708</Date>
        </PriceDate>
        <PriceDate>
          <PriceDateRole>15</PriceDateRole>
          <Date>20160708</Date>
        </PriceDate>
      </Price>
      <Price>
        <PriceType>42</PriceType>
        <PriceQualifier>08</PriceQualifier>
        <PriceAmount>3.99</PriceAmount>
        <CurrencyCode>EUR</CurrencyCode>
        <Territory>
          <CountriesIncluded>FR</CountriesIncluded>
        </Territory>
        <PriceDate>
          <PriceDateRole>14</PriceDateRole>
          <Date>20160801</Date>
        </PriceDate>
        <PriceDate>
          <PriceDateRole>15</PriceDateRole>
          <Date>20160815</Date>
        </PriceDate>
      </Price>
    </SupplyDetail>
  </ProductSupply>
</Product>
